 # Дано натуральное число. Напишите программу, которая вычисляет:
 #
 #     сумму его цифр;
 #     количество цифр в нем;
 #     произведение его цифр;
 #     среднее арифметическое его цифр;
 #     его первую цифру;
 #     сумму его первой и последней цифры.
 #
 # Формат входных данных
 # На вход программе подается одно натуральное число.
 #
 # Формат выходных данных
 # Программа должна вывести значения указанных величин в указанном порядке.

num = int(input())
y = 1
x = 0
total = 0
last = num % 10
while num != 0:
    x = x + (num % 10)  # сумма

    y = y * (num % 10)  # произведение
    total += 1

    z = num % 10

    num = num // 10

print(x)  # сумма
print(total)  # количество цифр
print(y)  # произведение цифр
print(x / total)  # среднее арифметическое
print(z)  # первая цифра
print(last + z)  # произведение первой и последней
