# На вход программе подается последовательность целых чисел от 11 до 55,
# характеризующее оценку ученика, каждое число на отдельной строке.
# Концом последовательности является любое неположительное число либо число, большее 55.
# Напишите программу, которая выводит количество пятерок.
#
# Формат входных данных
# На вход программе подается последовательность чисел, каждое число на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести количество пятерок.
#
# Примечание. Не забываем, что неположительными числами являются все отрицательные числа и число 00. 😉

num = int(input())
total = 0

while 1 <= num <= 5:

    if num == 5:
        total += 1
    num = int(input())
print(total)