# Дано натуральное число. Напишите программу, которая определяет,
# является ли последовательность его цифр при просмотре справа налево упорядоченной по неубыванию.
#
# Формат входных данных
# На вход программе подается одно натуральное число.
#
# Формат выходных данных
# Программа должна вывести «YES» если последовательность его цифр при просмотре справа налево
# является упорядоченной по неубыванию и «NO» в противном случае.







num = int(input())
flag = "Yes"
while num//10 > 0:
    x= num%10
    y = (num//10)%10

    if x < y:
        flag = 'Yes'
    else:
        flag = 'NO'
        break

    num =num// 10
print(flag)